app/views/comments/_comment.html.erb

<tr class="row" id="comment_<%= comment.id %>">
  <%- if comment.user.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]