app/views/issues/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."issue_id" = $1  [["issue_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."issue_id" = $1  [["issue_id", 1]]
---
        <td  class="span4"><%= issue.title %></td>
        <td style="text-align:center"><%= "#{issue.likes.count}" %></td>
        <td style="text-align:center"><%= link_to "#{issue.comments.count}", issue %></td>