app/views/likes/_like_button.html.erb

SELECT "likes".* FROM "likes" INNER JOIN "issues" ON "issues"."id" = "likes"."issue_id" INNER JOIN "users" ON "users"."id" = "likes"."user_id" WHERE "likes"."issue_id" = 1
---
<% if like = current_user.likes.find_by_issue_id(@issue.id) %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."issue_id" = $1  [["issue_id", 1]]
---
    <%= f.submit "Unfollow", class: 'btn' %>
    <% if @issue.likes.count == 1 %>