app/controllers/comments_controller.rb

SELECT "issues".* FROM "issues" WHERE "issues"."id" = $1 ORDER BY "issues"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "created_at", "issue_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asdd"], ["created_at", Fri, 13 Feb 2015 06:26:38 UTC +00:00], ["issue_id", 1], ["updated_at", Fri, 13 Feb 2015 06:26:38 UTC +00:00], ["user_id", 1]]
---
  def create
    @issue = Issue.find(params[:issue_id])
    @comment = @issue.comments.create(params[:comment])