app/controllers/issues_controller.rb

  def index
    @issues = Issue
    @issues = Issue.order(params[:sort]) if params[:sort]
---
SELECT "issues".* FROM "issues" ORDER BY no_followers