app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues" WHERE "issues"."id" = $1 ORDER BY "issues"."id" ASC LIMIT 1  [["id", 1]]
SELECT "likes".* FROM "likes" INNER JOIN "issues" ON "issues"."id" = "likes"."issue_id" INNER JOIN "users" ON "users"."id" = "likes"."user_id" WHERE "likes"."issue_id" = 1
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."issue_id" = 1 LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
  def show
    begin
      @issue = Issue.find(params[:id])

      @u = Like.joins(:issue, :user).where('issue_id' => params[:id])
      @users = []
      @u.each do |y|

SELECT "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", "8"]]
---
  def edit
    @issue = Issue.find(params[:id])

SELECT "issues".* FROM "issues" WHERE "issues"."title" IS NULL LIMIT 1
---
  def search
    @issue = Issue.find_by_title(params[:search_con])

INSERT INTO "issues" ("created_at", "description", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 13 Feb 2015 06:26:33 UTC +00:00], ["description", "abcdefg"], ["title", "ABC"], ["updated_at", Fri, 13 Feb 2015 06:26:33 UTC +00:00], ["user_id", 1]]
---
  def create
    @issue = Issue.new(issue_params)

    respond_to do |format|
      if @issue.save

SELECT "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "issues" SET "title" = 'Title', "description" = 'go to work', "updated_at" = '2014-01-09 07:55:53.465148' WHERE "issues"."id" = 2006
---
  def update
    @issue = Issue.find(params[:id])

    respond_to do |format|
      if @issue.update_attributes(issue_params)

SELECT "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", "10"]]
DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 10]]
---
  def destroy
    @issue = Issue.find(params[:id])
    @issue.destroy