app/controllers/likes_controller.rb

  def create
    @like = Like.create(params[:like])
---
INSERT INTO "likes" ("created_at", "issue_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 13 Feb 2015 06:53:19 UTC +00:00], ["issue_id", 2], ["updated_at", Fri, 13 Feb 2015 06:53:19 UTC +00:00], ["user_id", 1]]